In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('titanic.csv')

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.drop(['Name','PassengerId','Parch','SibSp','Ticket','Cabin','Embarked'], axis="columns", inplace = True)

In [5]:
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [6]:
dummies = pd.get_dummies(df.Sex)

In [7]:
df = pd.concat([df,dummies], axis ='columns')

In [8]:
df.drop('Sex', axis= 'columns' , inplace = True)

In [9]:
df.head()

   Survived  Pclass   Age     Fare  female   male
0         0       3  22.0   7.2500   False   True
1         1       1  38.0  71.2833    True  False
2         1       3  26.0   7.9250    True  False
3         1       1  35.0  53.1000    True  False
4         0       3  35.0   8.0500   False   True

In [10]:
df.head(6)

   Survived  Pclass   Age     Fare  female   male
0         0       3  22.0   7.2500   False   True
1         1       1  38.0  71.2833    True  False
2         1       3  26.0   7.9250    True  False
3         1       1  35.0  53.1000    True  False
4         0       3  35.0   8.0500   False   True
5         0       3   NaN   8.4583   False   True

In [11]:
df.fillna(df.Age.mean(), inplace=True)

In [12]:
df.head(6)

   Survived  Pclass        Age     Fare  female   male
0         0       3  22.000000   7.2500   False   True
1         1       1  38.000000  71.2833    True  False
2         1       3  26.000000   7.9250    True  False
3         1       1  35.000000  53.1000    True  False
4         0       3  35.000000   8.0500   False   True
5         0       3  29.699118   8.4583   False   True

In [13]:
input = df.drop('Pclass', axis= 'columns' )

In [14]:
df.head(7)

   Survived  Pclass        Age     Fare  female   male
0         0       3  22.000000   7.2500   False   True
1         1       1  38.000000  71.2833    True  False
2         1       3  26.000000   7.9250    True  False
3         1       1  35.000000  53.1000    True  False
4         0       3  35.000000   8.0500   False   True
5         0       3  29.699118   8.4583   False   True
6         0       1  54.000000  51.8625   False   True

In [16]:
x = df.drop('Survived', axis='columns')

In [17]:
y = df.Survived

In [33]:
from sklearn.model_selection import train_test_split
x_train , x_test, y_train, y_test =  train_test_split(x, y,train_size=0.8)

In [19]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [34]:
model.fit(x_train,y_train)
model.score(x_test,y_test)

0.7877094972067039

In [35]:
print(x_test)

     Pclass   Age      Fare  female   male
816       3  23.0    7.9250    True  False
10        3   4.0   16.7000    True  False
889       1  26.0   30.0000   False   True
127       3  24.0    7.1417   False   True
605       3  36.0   15.5500   False   True
..      ...   ...       ...     ...    ...
134       2  25.0   13.0000   False   True
248       1  37.0   52.5542   False   True
348       3   3.0   15.9000   False   True
574       3  16.0    8.0500   False   True
325       1  36.0  135.6333    True  False

[179 rows x 5 columns]

In [36]:
y_test.head()

816    0
10     1
889    1
127    1
605    0
Name: Survived, dtype: int64

In [37]:
model.predict_proba(x_test)

array([[5.65427687e-02, 9.43457231e-01],
       [3.17980880e-02, 9.68201912e-01],
       [9.09362284e-01, 9.06377156e-02],
       [9.87848721e-01, 1.21512789e-02],
       [9.89227752e-01, 1.07722484e-02],
       [9.68379974e-01, 3.16200259e-02],
       [9.70134470e-01, 2.98655295e-02],
       [9.71789390e-01, 2.82106103e-02],
       [9.86153707e-01, 1.38462927e-02],
       [9.18809007e-01, 8.11909929e-02],
       [9.76013615e-01, 2.39863851e-02],
       [9.89090945e-01, 1.09090545e-02],
       [9.86204412e-01, 1.37955885e-02],
       [9.89226205e-01, 1.07737952e-02],
       [6.20186641e-02, 9.37981336e-01],
       [9.88072358e-01, 1.19276416e-02],
       [9.74287391e-01, 2.57126092e-02],
       [5.93500412e-02, 9.40649959e-01],
       [9.88797906e-01, 1.12020937e-02],
       [2.89613554e-02, 9.71038645e-01],
       [9.15357467e-01, 8.46425335e-02],
       [9.88793840e-01, 1.12061603e-02],
       [6.02452250e-02, 9.39754775e-01],
       [7.75114878e-03, 9.92248851e-01],
       [4.37553334e-02, 9.56244667e-01],
       [9.66091206e-01, 3.39087944e-02],
       [2.81492611e-02, 9.71850739e-01],
       [9.88332357e-01, 1.16676432e-02],
       [6.20186641e-02, 9.37981336e-01],
       [9.86890689e-01, 1.31093109e-02],
       [9.88947216e-01, 1.10527844e-02],
       [9.88797906e-01, 1.12020937e-02],
       [9.88497116e-01, 1.15028840e-02],
       [9.88824674e-01, 1.11753260e-02],
       [9.72795679e-01, 2.72043213e-02],
       [9.69397338e-04, 9.99030603e-01],
       [5.19647654e-02, 9.48035235e-01],
       [9.86856406e-01, 1.31435939e-02],
       [9.72912416e-01, 2.70875844e-02],
       [5.43687313e-02, 9.45631269e-01],
       [6.20555011e-02, 9.37944499e-01],
       [4.64562261e-02, 9.53543774e-01],
       [9.72874321e-01, 2.71256791e-02],
       [4.79362153e-03, 9.95206378e-01],
       [9.88788606e-01, 1.12113943e-02],
       [9.75289048e-01, 2.47109518e-02],
       [9.75008628e-01, 2.49913720e-02],
       [9.89179392e-01, 1.08206081e-02],
       [6.20898287e-02, 9.37910171e-01],
       [9.19200955e-01, 8.07990448e-02],
       [9.86597428e-01, 1.34025718e-02],
       [9.13799566e-01, 8.62004344e-02],
       [8.77580719e-01, 1.22419281e-01],
       [9.88294460e-01, 1.17055404e-02],
       [9.73135651e-01, 2.68643491e-02],
       [1.67273600e-34, 1.00000000e+00],
       [9.88429557e-01, 1.15704433e-02],
       [9.16035124e-01, 8.39648763e-02],
       [8.33068838e-01, 1.66931162e-01],
       [9.78487175e-01, 2.15128250e-02],
       [5.23282353e-03, 9.94767176e-01],
       [9.73798010e-01, 2.62019899e-02],
       [9.88777933e-01, 1.12220672e-02],
       [9.07135126e-01, 9.28648741e-02],
       [9.79037713e-01, 2.09622872e-02],
       [6.31711377e-01, 3.68288623e-01],
       [9.88132785e-01, 1.18672155e-02],
       [9.68171337e-01, 3.18286628e-02],
       [9.70485961e-01, 2.95140394e-02],
       [2.92750561e-03, 9.97072494e-01],
       [9.62848106e-01, 3.71518938e-02],
       [6.66504389e-05, 9.99933350e-01],
       [9.76290607e-01, 2.37093935e-02],
       [9.64196896e-01, 3.58031045e-02],
       [9.86667023e-01, 1.33329772e-02],
       [9.88073363e-01, 1.19266374e-02],
       [9.85011300e-01, 1.49887002e-02],
       [9.14582248e-01, 8.54177522e-02],
       [9.88772190e-01, 1.12278101e-02],
       [9.74287391e-01, 2.57126092e-02],
       [2.50229337e-02, 9.74977066e-01],
       [1.52860771e-10, 1.00000000e+00],
       [9.75656544e-01, 2.43434562e-02],
       [9.59163370e-01, 4.08366297e-02],
       [3.90004857e-06, 9.99996100e-01],
       [4.86471154e-03, 9.95135288e-01],
       [9.89196332e-01, 1.08036683e-02],
       [9.88793247e-01, 1.12067528e-02],
       [3.85080601e-02, 9.61491940e-01],
       [2.92456697e-04, 9.99707543e-01],
       [9.86214482e-01, 1.37855179e-02],
       [9.76303849e-01, 2.36961514e-02],
       [8.74450250e-01, 1.25549750e-01],
       [9.39402544e-01, 6.05974559e-02],
       [6.27582364e-02, 9.37241764e-01],
       [6.16045534e-02, 9.38395447e-01],
       [2.79007935e-02, 9.72099206e-01],
       [8.84939282e-01, 1.15060718e-01],
       [9.87411599e-01, 1.25884006e-02],
       [9.89198671e-01, 1.08013294e-02],
       [9.75154346e-01, 2.48456540e-02],
       [9.88474101e-01, 1.15258992e-02],
       [9.88780722e-01, 1.12192785e-02],
       [2.65487338e-02, 9.73451266e-01],
       [9.87406957e-01, 1.25930427e-02],
       [9.85462824e-01, 1.45371759e-02],
       [2.72205891e-02, 9.72779411e-01],
       [9.87384535e-01, 1.26154647e-02],
       [9.88797906e-01, 1.12020937e-02],
       [2.96421906e-02, 9.70357809e-01],
       [2.71866456e-02, 9.72813354e-01],
       [9.88777933e-01, 1.12220672e-02],
       [1.14945028e-02, 9.88505497e-01],
       [2.79356120e-03, 9.97206439e-01],
       [9.86544920e-01, 1.34550803e-02],
       [9.88812630e-01, 1.11873696e-02],
       [8.13557198e-03, 9.91864428e-01],
       [9.79452220e-01, 2.05477799e-02],
       [9.88797906e-01, 1.12020937e-02],
       [1.99376914e-03, 9.98006231e-01],
       [2.69909728e-02, 9.73009027e-01],
       [9.88832627e-01, 1.11673725e-02],
       [1.94401613e-02, 9.80559839e-01],
       [6.20617527e-02, 9.37938247e-01],
       [5.08119848e-02, 9.49188015e-01],
       [1.25344906e-37, 1.00000000e+00],
       [6.24870884e-02, 9.37512912e-01],
       [2.54446442e-02, 9.74555356e-01],
       [1.47352534e-03, 9.98526475e-01],
       [3.32060162e-02, 9.66793984e-01],
       [9.38391031e-04, 9.99061609e-01],
       [2.71526130e-02, 9.72847387e-01],
       [5.33481263e-02, 9.46651874e-01],
       [6.20186641e-02, 9.37981336e-01],
       [5.10045764e-03, 9.94899542e-01],
       [9.86856406e-01, 1.31435939e-02],
       [1.86963006e-03, 9.98130370e-01],
       [3.00793876e-09, 9.99999997e-01],
       [9.73650991e-01, 2.63490088e-02],
       [9.87403845e-01, 1.25961554e-02],
       [6.93780572e-01, 3.06219428e-01],
       [6.10596130e-02, 9.38940387e-01],
       [9.88962091e-01, 1.10379093e-02],
       [6.19880912e-02, 9.38011909e-01],
       [9.86979611e-01, 1.30203894e-02],
       [9.74138637e-01, 2.58613633e-02],
       [9.31285114e-01, 6.87148864e-02],
       [9.88049583e-01, 1.19504169e-02],
       [2.22856399e-02, 9.77714360e-01],
       [1.39281754e-11, 1.00000000e+00],
       [6.19352646e-02, 9.38064735e-01],
       [2.99322939e-02, 9.70067706e-01],
       [3.38363690e-03, 9.96616363e-01],
       [9.87908085e-01, 1.20919145e-02],
       [9.12581538e-01, 8.74184624e-02],
       [5.20760998e-02, 9.47923900e-01],
       [5.73645725e-02, 9.42635428e-01],
       [9.18005708e-01, 8.19942922e-02],
       [9.74287391e-01, 2.57126092e-02],
       [9.88797906e-01, 1.12020937e-02],
       [6.21809604e-02, 9.37819040e-01],
       [9.87873250e-01, 1.21267502e-02],
       [9.89017594e-01, 1.09824061e-02],
       [9.88797906e-01, 1.12020937e-02],
       [9.71917869e-01, 2.80821307e-02],
       [9.87870251e-01, 1.21297490e-02],
       [1.28822235e-03, 9.98711778e-01],
       [8.80147578e-01, 1.19852422e-01],
       [9.89014916e-01, 1.09850840e-02],
       [9.74579715e-01, 2.54202845e-02],
       [9.88797906e-01, 1.12020937e-02],
       [1.39958213e-02, 9.86004179e-01],
       [5.68151916e-02, 9.43184808e-01],
       [9.87143323e-01, 1.28566771e-02],
       [9.73798010e-01, 2.62019899e-02],
       [8.77333329e-01, 1.22666671e-01],
       [9.76753510e-01, 2.32464904e-02],
       [9.85462824e-01, 1.45371759e-02],
       [6.68372500e-05, 9.99933163e-01]])